Repository: AAWESOMEUSERNAME/ariticle
Catalog: Swing History 101/Swing History 101-level1.tmx
Source language: en_us
Languages: zh_cn

source: (According to historian Marshall Stearns, the step most likely came from Ashanti African dance movement, however he provides no reason why and the step has little resemblance to any Ashanti dancing available online.) The characteristic of twisting steps, and the forward-and-back characteristics of the dance, however, are found in several cultures of Africa and the diaspora.
zh_cn: （根据历史学家Marshall Stearns的研究，这种舞步很可能来自于非洲西部阿善堤地区，但是他并没有解释为什么查尔斯顿舞步和现在网络上能找到的阿善堤舞蹈基本没有相似的地方。）然而，在一些非洲文化和流民文化中却发现了查尔斯顿标志性的扭脚腕的步子和前后移动。

source: (Imagine the “Land of a Thousand Dances” song, thirty or forty years earlier.)
zh_cn: （想象一下“Land of a Thousand Dances” 这首歌向前推三四十年。）

source: (The song is the one that comes into your head when you hear the word “Charleston.” It was composed by James P. Johnson, an African-American and one of early-20th-century's greatest masters of composition.)
zh_cn: （那首歌就是你一听到“查尔斯顿”这个词马上就会出现在脑海里的《查尔斯顿》，作曲为 James P. Johnson —— 一位非裔美国人，20年代早期最伟大的作曲家之一。）

source: (There was even such a noticeable group of Charleston jazz musicians that “rice” became the universal nickname they'd use for each other.)
zh_cn: （查尔斯顿爵士音乐家颇具规模，以至于“大米”成了爵士音乐家们称呼彼此的通用称谓。译者注：此处翻译存疑，有查到一种经典低地美食叫查尔斯顿红米，怀疑和此有关。）

source: Before the civil war, the South Carolina city was a major port that brought in enslaved peoples from Africa, and it's on that continent that the Charleston step might have begun, or it might have been purely a product of the American-Gullah culture, an offspring of their American experience and African dance traditions.
zh_cn: 南北战争以前，南卡罗莱纳的城市是主要的非洲奴隶流入地之一，查尔斯顿舞步或许就起源于非洲，也有可能查尔斯顿舞步是纯粹的嘎勒美国人文化产物（译者注：嘎勒人，居住在佐治亚州和南卡罗来纳州的黑人）—— 他们在美国的经历与非洲舞蹈传统相互融合的产物。

source: For more than three hundred years in America, the three main harbors on the East Coast were New York, Boston, and Charleston, with constant traffic between the three.
zh_cn: 在超过300年的时间里，美国东海岸的3个主要港口城市分别是纽约、波士顿、查尔斯顿。这3个城市之间一直维持着稳定的交通往来。

source: Frankie Manning and Cynthia Millman described it as a closer-embrace partnered Charleston with kicking heels behind more than swinging legs.
zh_cn: Frankie Manning和Cynthia Millman

source: How much of a fad it became is hard to underestimate in modern terms, we have experienced nothing that so completely engulfed all of American culture, Black, White, rich, poor — anyone could do the simple stylized step, as well as add to it a large number of other dance steps that went well to jazz.
zh_cn: 身处现代，很难预估查尔斯顿曾经成为了何种风潮，毕竟我们从未体验过那样一种完全吞没了全美的文化——无论黑人或白人，无论贫穷或富有，任何人都可以做出这种简单的风格显著的舞步，并加入大量其他的很适合爵士乐的舞步。

source: However, the step had been around awhile before that.
zh_cn: 然而，其实在这之前，一切便早已开始。

source: In late 1920s Harlem, New York, for instance, there were at least three partnered dances on the hardwood floors of jazz clubs: Harlem's own style of partnered Charleston, a second dance called The Breakaway, and a third dance we don't know much about called The Collegiate.
zh_cn: 举个例子，1920年代晚期的纽约哈莱姆，爵士酒吧的木地板上至少就有三种双人舞：哈莱姆独有风格的双人查尔斯顿、开合舞（The Breakaway）以及另一种我们知之甚少的名为可乐鸡的舞蹈（The Collegiate，译者注：未找到合适的中文翻译词汇，故选用collegiate shag的空耳梗，手动狗头。）

source: In the 1900s, new American musical forms began to emerge from the Black and Creole communities of New Orleans in popular culture — first ragtime, and then early “hot” jazz — were no exception.
zh_cn: 1900年代，诞生于新奥尔良（New Orleans）黑人和克里奥尔（译者注：克里奥尔，Creole，路易斯安那州的法国移民后裔。）社区的新流行音乐文化——起初是拉格泰姆（ragtime），紧接是备受欢迎的早期爵士——亦非例外。

source: In the world of street dances, the music always comes first.
zh_cn: 在街头舞蹈的世界里，音乐总是先行出现的。

source: It was in the middle of the 1920s, when the jazz age was going strong, that America encountered one of its first and greatest nation-wide fads: The Charleston. That was in 1923, when it was danced on the stage to a song in the popular all-Black Broadway show Runnin' Wild.
zh_cn: 1920年代，当爵士风暴愈发强劲，美国迎来了史上第一次，也是最伟大的一次全国潮流：查尔斯顿（The Charleston）。那是在1923年，伴着备受欢迎的全黑人阵容百老汇大秀《Runnin' Wild》中的一支曲子，查尔斯顿首次进入了公众视野。

source: It wasn't simply coincidence the song and dance were named “Charleston.” Johnson had seen the step done as early as the 1910s, when he was improvising piano music for dancers at clubs — most of the dancers doing the step had come from Charleston, and so he called the dance songs he wrote for them “Charlestons.” Other Black performers from South Carolina had done similar steps often enough they were referred to as “geechie” or “gullah” steps, a specific Black culture of Charleston and the low country.
zh_cn: 这首歌以及这种舞蹈叫“查尔斯顿”并不是一个简单的巧合。Johnson早在1910年代为俱乐部里的舞者即兴伴奏时就已经看到过这种舞步 —— 大部分跳这种舞步的舞者都来自查尔斯顿（译者注：南卡罗莱纳州的一座城市），因此他称自己伴奏的那些曲子为“查尔斯顿曲”。其他来自南卡罗莱纳州的黑人表演者也经常跳一些类似的舞步，他们称之为“吉奇步（geechie）”或“嘎勒步（gullah）”，一种来自查尔斯顿和南卡罗莱纳低地（Lowcountry）的特殊黑人文化。

source: Made in Carolina
zh_cn: 卡罗莱纳（Carolina）制造

source: Made in Harlem
zh_cn: 哈莱姆（Harlem）制造

source: Many regional, and soon nationwide, dances began to evolve to this music.
zh_cn: 很多区域性的，并且在不久后传播至全国的舞蹈开始受到这种音乐的影响。

source: Music Comes First
zh_cn: 音乐先行

source: Once it hit Broadway in 1923, the Charleston step swept across the nation and came to define the jazz age, even though it was a mainstream infatuation for only a few years.
zh_cn: 查尔斯顿在1923年的百老汇一经演出，便席卷了全国，并成为了爵士年代的标志，尽管这种主流的追捧仅持续了几年。

source: People hear a new music form start to arise, and it's only a matter of time before they begin to move to it.
zh_cn: 每当一种新的音乐形式开始兴起，人们伴着这种音乐舞动就只是时间问题了。

source: So the roots of the step, at least, have been around for long time.
zh_cn: 所以至少这种舞步的起源已经存在了相当长的时间了。

source: The Charleston soon came in both a solo form and a partnered form.
zh_cn: 很快，查尔斯顿同时发展出了单人跳法和双人跳法。

source: The Charleston wasn't the only dance step being done to ragtime and jazz.
zh_cn: 查尔斯顿并不是唯一一种跟着拉格泰姆和爵士跳的舞步。

source: There were dozens of dances, solo and partnered, and fad dance steps from the 10s to the 40s.
zh_cn: 单人舞、双人舞以及从1910年代到1940年代的时尚舞步，舞蹈的种类有很多。

source: This is a series for beginner dancers.
zh_cn: 这是写给新人舞者的一系列文章。

source: This made it relatively easy for people of Charleston to travel to New York, especially those who worked in the shipping or entertainment industries.
zh_cn: 这使得人们可以相对容易地在查尔斯顿和纽约间旅行，特别是从事海运行业或娱乐业的人们。

source: This post was updated with new information in 2018 and 2019.
zh_cn: 本文已于2018年和2019年进行过更新。

source: Why was Charleston culture prominent enough in New York to make its way in Broadway musical, where mainstream America took many of its cultural cues?
zh_cn: 为何查尔斯顿文化能够在纽约，这个主流美国人的潮流之都中脱颖而出？
